# <center> <b> LECTURE 04 : BÀI TẬP THỰC HÀNH TRÊN LỚP

In [69]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [70]:
df1 = pd.read_csv('mexico-real-estate-1.csv')

# **Clean file mexico-real-estate-1.csv**

In [71]:
# Overview data
df1.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150.0,"$67,965.56"
1,house,Nuevo León,25.688436,-100.198807,186.0,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82.0,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150.0,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175.0,"$94,835.67"

In [72]:
# Check xem mỗi cột có bao dữ liệu bị null
df1.isnull().sum()

property_type      0
state              0
lat              117
lon              117
area_m2            0
price_usd          0
dtype: int64

In [73]:
# Xóa dữ liệu bị null
df1 = df1.dropna()

In [74]:
# Check xem lại mỗi cột có bao dữ liệu bị null
df1.isnull().sum()

property_type    0
state            0
lat              0
lon              0
area_m2          0
price_usd        0
dtype: int64

In [75]:
#Check dữ liệu bị trùng lặp
df1.duplicated().sum()

np.int64(0)

In [76]:
# Remove những ký $, , và ép kiểu về float cho column price_usd
df1['price_usd'] = df1['price_usd'].str.replace("$", "")
df1['price_usd'] = df1['price_usd'].str.replace(",", "")
df1['price_usd'] = df1['price_usd'].astype("float")

In [77]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    float64
 5   price_usd      583 non-null    float64
dtypes: float64(4), object(2)
memory usage: 31.9+ KB

In [78]:
# Overview data
df1.head()

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528    150.0   67965.56
1         house        Nuevo León  25.688436 -100.198807    186.0   63223.78
2     apartment          Guerrero  16.767704  -99.764383     82.0   84298.37
3     apartment          Guerrero  16.829782  -99.911012    150.0   94308.80
5         house           Yucatán  21.052583  -89.538639    205.0  105191.37

# **Clean file mexico-real-estate-2.csv**

In [79]:
df2 = pd.read_csv('mexico-real-estate-2.csv')

In [80]:
# Overview data
df2.head()

  property_type       state        lat         lon  area_m2  price_mxn
0     apartment  Nuevo León  25.721081 -100.345581     72.0  1300000.0
1     apartment      Puebla        NaN         NaN    190.0  2500000.0
2         house     Morelos  23.634501 -102.552788    360.0  5300000.0
3         house     Morelos        NaN         NaN     76.0   820000.0
4         house      Puebla        NaN         NaN    200.0  1100000.0

In [81]:
# Check xem  mỗi cột có bao dữ liệu bị null
df2.isnull().sum()

property_type      0
state              0
lat              129
lon              129
area_m2            0
price_mxn          0
dtype: int64

In [82]:
# Xóa dữ liệu bị null
df2 = df2.dropna()

In [83]:
# Check xem  mỗi cột có bao dữ liệu bị null
df2.isnull().sum()

property_type    0
state            0
lat              0
lon              0
area_m2          0
price_mxn        0
dtype: int64

In [84]:
#Check dữ liệu bị trùng lặp
df2.duplicated().sum()

np.int64(1)

In [85]:
# Remove data bị trùng lặp
df2 = df2.drop_duplicates()

In [86]:
#Check lại xem dữ liệu bị trùng lặp
df2.duplicated().sum()

np.int64(0)

In [87]:
# Tạo new column price_usd để unify với df1.
df2['price_usd'] = df2['price_mxn'] * 0.051

In [88]:
# Xóa cột 'price_mxn'
df2 = df2.drop(columns=['price_mxn'])

In [89]:
df2.head()

  property_type             state        lat         lon  area_m2  price_usd
0     apartment        Nuevo León  25.721081 -100.345581     72.0   66300.00
2         house           Morelos  23.634501 -102.552788    360.0  270300.00
6     apartment  Estado de México  19.272040  -99.572013     85.0   63750.00
7         house   San Luis Potosí  22.138882 -100.996510    158.0  108120.00
8     apartment  Distrito Federal  19.394558  -99.129707     65.0   38667.69

In [90]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 570 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  570 non-null    object
 1   state          570 non-null    object
 2   lat            570 non-null    float64
 3   lon            570 non-null    float64
 4   area_m2        570 non-null    float64
 5   price_usd      570 non-null    float64
dtypes: float64(4), object(2)
memory usage: 31.2+ KB

# **Clean file mexico-real-estate-3.csv**

In [91]:
df3 = pd.read_csv('mexico-real-estate-3.csv')

In [92]:
# Check xem  mỗi cột có bao dữ liệu bị null
df3.isnull().sum()

property_type                0
place_with_parent_names      0
lat-lon                    118
area_m2                      0
price_usd                    0
dtype: int64

In [93]:
# Xóa dữ liệu bị null
df3 = df3.dropna()

In [94]:
# Check xem lại mỗi cột có bao dữ liệu bị null
df3.isnull().sum()

property_type              0
place_with_parent_names    0
lat-lon                    0
area_m2                    0
price_usd                  0
dtype: int64

In [95]:
#Check dữ liệu bị trùng lặp
df3.duplicated().sum()

np.int64(1)

In [96]:
# Remove data bị trùng lặp
df3 = df3.drop_duplicates()

In [97]:
#Check lại xem dữ liệu bị trùng lặp
df3.duplicated().sum()

np.int64(0)

In [98]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71.0,48550.59
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233.0,168636.73
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300.0,86932.69
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84.0,68508.67
5,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175.0,102763.00

In [99]:
df3['state'] = df3['place_with_parent_names'].str.split("|", expand = True)[2]

In [100]:
df3['lat'] = df3['lat-lon'].str.split(",", expand= True)[0]

In [101]:
df3['lon'] = df3['lat-lon'].str.split(",", expand= True)[1]

In [102]:
# Xóa cột 'place_with_parent_names', 'lat-lon'
df3 = df3.drop(columns=['place_with_parent_names', 'lat-lon'])

In [ ]:
# Sắp xếp thứ tự column để unify với df1 và df2
df3 = df3[['property_type', 'state', 'lat','lon','area_m2', 'price_usd']]

In [108]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 581 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  581 non-null    object
 1   state          581 non-null    object
 2   lat            581 non-null    object
 3   lon            581 non-null    object
 4   area_m2        581 non-null    float64
 5   price_usd      581 non-null    float64
dtypes: float64(2), object(4)
memory usage: 31.8+ KB

# **Tổng hợp dữ liệu**

In [113]:
# Union all 3 df
df = pd.concat([df1, df2, df3])

In [115]:
#Check lại xem dữ liệu bị trùng lặp
df.duplicated().sum()

np.int64(0)

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1734 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1734 non-null   object
 1   state          1734 non-null   object
 2   lat            1734 non-null   object
 3   lon            1734 non-null   object
 4   area_m2        1734 non-null   float64
 5   price_usd      1734 non-null   float64
dtypes: float64(2), object(4)
memory usage: 94.8+ KB

In [117]:
df.head()

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528    150.0   67965.56
1         house        Nuevo León  25.688436 -100.198807    186.0   63223.78
2     apartment          Guerrero  16.767704  -99.764383     82.0   84298.37
3     apartment          Guerrero  16.829782  -99.911012    150.0   94308.80
5         house           Yucatán  21.052583  -89.538639    205.0  105191.37

In [118]:
df.to_csv('file_final.csv')